zozo825117/stm32f429ev_1/ST_EMWIN/STemWinLibrary522/Config/LCD_Config.c
  /* Use DMA2D for the conversion */
  DMA_ConvertColor(aBufferDMA2D, pIndex, LTDC_Pixelformat_ARGB8888, PixelFormat, NumItems);
}

/**
  * @brief  
  * @param  pFG 
  * @param  pBG
  * @param  pDst
  * @param  OffFG
  * @param  OffBG
  * @param  OffDest 
  * @param  xSize
  * @param  ySize
  * @param  Intens
  * @retval None
  */
static void LCD_MixColorsBulk(U32 * pFG, U32 * pBG, U32 * pDst, unsigned OffFG, unsigned OffBG, unsigned OffDest, unsigned xSize, unsigned ySize, U8 Intens) {
  int y;

  GUI_USE_PARA(OffFG);
  GUI_USE_PARA(OffDest);
  for (y = 0; y < ySize; y++) 
  {
    /* Invert alpha values */
    InvertAlpha(pFG, aBuffer_FG, xSize);
    InvertAlpha(pBG, aBuffer_BG, xSize);

    DMA_MixColorsBulk(aBuffer_FG, aBuffer_BG, aBufferDMA2D, Intens, xSize);

    InvertAlpha(aBufferDMA2D, pDst, xSize);
    pFG  += xSize + OffFG;
    pBG  += xSize + OffBG;
    pDst += xSize + OffDest;
  }
}

/**
  * @brief  
  * @param  LTDC_Layerx 
  * @param  NewState
  * @retval None
  */
static void LTDC_LayerEnableColorKeying(LTDC_Layer_TypeDef * LTDC_Layerx, int NewState)
{
  if (NewState != DISABLE)
  {
    LTDC_Layerx->CR |= (uint32_t)LTDC_LxCR_COLKEN;
  } 
  else 
  {
    LTDC_Layerx->CR &= ~(uint32_t)LTDC_LxCR_COLKEN;
  }
  LTDC->SRCR = LTDC_SRCR_VBR; /* Reload on next blanking period */
}

/**
  * @brief  
  * @param  LayerIndex 
  * @param  xPos
  * @param  yPos
  * @retval None
  */
static void LTDC_SetLayerPos(int LayerIndex, int xPos, int yPos)
{
  int xSize, ySize;
  uint32_t HorizontalStart, HorizontalStop, VerticalStart, VerticalStop;

  xSize = LCD_GetXSizeEx(LayerIndex);
  ySize = LCD_GetYSizeEx(LayerIndex);
  HorizontalStart = xPos + HBP + 1;
  HorizontalStop  = xPos + HBP + xSize;
  VerticalStart   = yPos + VBP + 1;
  VerticalStop    = yPos + VBP + ySize;
  
  /* Horizontal start and stop position */
  apLayer[LayerIndex]->WHPCR &= ~(LTDC_LxWHPCR_WHSTPOS | LTDC_LxWHPCR_WHSPPOS);
  apLayer[LayerIndex]->WHPCR = (HorizontalStart | (HorizontalStop << 16));
  
  /* Vertical start and stop position */
  apLayer[LayerIndex]->WVPCR &= ~(LTDC_LxWVPCR_WVSTPOS | LTDC_LxWVPCR_WVSPPOS);
  apLayer[LayerIndex]->WVPCR  = (VerticalStart | (VerticalStop << 16));
  
  /* Reload configuration */
  LTDC_ReloadConfig(LTDC_SRCR_VBR); /* Reload on next blanking period */
}

/**
  * @brief  
  * @param  LayerIndex 
  * @param  Alpha
  * @retval None
  */
static void LTDC_SetLayerAlpha(int LayerIndex, int Alpha)
{
  /* Set constant alpha value */
  apLayer[LayerIndex]->CACR &= ~(LTDC_LxCACR_CONSTA);
  apLayer[LayerIndex]->CACR  = 255 - Alpha;
  
  /* Reload configuration */
  LTDC_ReloadConfig(LTDC_SRCR_IMR);
}

/**
  * @brief  
  * @param  LayerIndex 
  * @param  Color
  * @param  Pos
  * @retval None
  */
static void LTDC_SetLUTEntry(int LayerIndex, uint32_t Color, int Pos) 
{
  uint32_t r, g, b, a;

  r = ( Color        & 0xff) << 16;
  g = ((Color >>  8) & 0xff) <<  8;
  b = ((Color >> 16) & 0xff);
  a = Pos << 24;
  apLayer[LayerIndex]->CLUTWR &= ~(LTDC_LxCLUTWR_BLUE | LTDC_LxCLUTWR_GREEN | LTDC_LxCLUTWR_RED | LTDC_LxCLUTWR_CLUTADD);
  apLayer[LayerIndex]->CLUTWR  = r | g | b | a;
  
  /* Reload configuration */
  LTDC_ReloadConfig(LTDC_SRCR_IMR);
}

/**
  * @brief  Copy a memory area content to another memory area
  * @param  LayerIndex: Layer index
  * @param  pSrc: Source address
  * @param  pDst: Destination address
  * @param  xSize: width of the area to be transfered
  * @param  ySize: height of the area to be transfered
  * @param  OffLineSrc: Source line offset
  * @param  OffLineDst: Destination line offset
  * @retval None
  */
static void DMA2D_Copy(uint32_t LayerIndex, void * pSrc, void * pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLineSrc, uint32_t OffLineDst)
{
  uint32_t PixelFormat;

  PixelFormat =  GetPixelformat(LayerIndex);
  DMA2D->CR      = 0x00000000UL | (1 << 9);              /* Memory to memory and TCIE                     */
  DMA2D->FGMAR   = (uint32_t)pSrc;                       /* Source address                                */
  DMA2D->OMAR    = (uint32_t)pDst;                       /* Destination address                           */
  DMA2D->FGOR    = OffLineSrc;                           /* Source line offset                            */
  DMA2D->OOR     = OffLineDst;                           /* Destination line offset                       */
  DMA2D->FGPFCCR = PixelFormat;                          /* Defines the number of pixels to be transfered */
  DMA2D->NLR     = (uint32_t)(xSize << 16) | (U16)ySize; /* Size configuration of area to be transfered   */
  DMA2D->CR     |= DMA2D_CR_START;                       /* Start operation                               */

  while (DMA2D->CR & DMA2D_CR_START) 
  {
  }
}

/**
  * @brief  Fill a color index into a memory area
  * @param  LayerIndex: Layer index
  * @param  pDst: Destination address
  * @param  xSize: width of the area to be transfered
  * @param  ySize: height of the area to be transfered
  * @param  OffLine: Destination line offset
  * @param  ColorIndex: Color to be used
  * @retval None
  */
static void DMA2D_Fill(uint32_t LayerIndex, void * pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLine, uint32_t ColorIndex)
{
  uint32_t PixelFormat;

  PixelFormat = GetPixelformat(LayerIndex);  //得到GUI用的颜色格式
  DMA2D->CR      = 0x00030000UL | (1 << 9);              /* Register to memory and TCIE                   */
  DMA2D->OCOLR   = ColorIndex;                           /* Color to be used                              */
  DMA2D->OMAR    = (uint32_t)pDst;                       /* Destination address                           */
  DMA2D->OOR     = OffLine;                              /* Destination line offset                       */
  DMA2D->OPFCCR  = PixelFormat;                          /* Defines the number of pixels to be transfered */
  DMA2D->NLR     = (uint32_t)(xSize << 16) | (U16)ySize; /* Size configuration of area to be transfered   */
  DMA2D->CR     |= DMA2D_CR_START;                       /* Start operation                               */
  
  while (DMA2D->CR & DMA2D_CR_START) 
  {
  }
}

///**
//  * @brief  LCD Low level initialization 
//  * @param  LayerIndex: Layer index
//  * @retval None
//  */
//static void LCD_LL_Init(uint32_t LayerIndex) 
//{
//  uint32_t xSize, ySize, BytesPerLine, BitsPerPixel, i;
//  uint32_t Color;
//  static uint32_t Is_Initialized;
//  
//  LTDC_InitTypeDef       LTDC_InitStruct;
//  LTDC_Layer_InitTypeDef LTDC_Layer_Init;
//  LTDC_CLUT_InitTypeDef  LTDC_CLUT_InitStruct;
//  
//  if (LayerIndex >= GUI_NUM_LAYERS) 
//  {
//    return;
//  }
//  if (Is_Initialized == 0) 
//  {
//    Is_Initialized = 1;
//    
//    /*  Clock configuration */
//    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2D, ENABLE); //使能DMA2D时钟
//    
//    /* Enable the LTDC Clock */
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_LTDC, ENABLE);//使能LCD时钟
//    
//    /* Enable the DMA2D Clock */
//    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2D, ENABLE); 
//    
//    /* Configure the LCD Control pins */
//    LCD_AF_GPIOConfig();  //LCD引脚初始化
//    
//    /* Polarity configuration */
//    /* Initialize the horizontal synchronization polarity as active low */
//    LTDC_InitStruct.LTDC_HSPolarity = LTDC_HSPolarity_AL;     
//    /* Initialize the vertical synchronization polarity as active low */  
//    LTDC_InitStruct.LTDC_VSPolarity = LTDC_VSPolarity_AL;     
//    /* Initialize the data enable polarity as active low */
//    LTDC_InitStruct.LTDC_DEPolarity = LTDC_DEPolarity_AL;     
//    /* Initialize the pixel clock polarity as input pixel clock */ 
//    LTDC_InitStruct.LTDC_PCPolarity = LTDC_PCPolarity_IPC;
//    
//    /* Configure R,G,B component values for LCD background color */                   
//    LTDC_InitStruct.LTDC_BackgroundRedValue = 0;            
//    LTDC_InitStruct.LTDC_BackgroundGreenValue = 0;          
//    LTDC_InitStruct.LTDC_BackgroundBlueValue = 0;  
//    
//    
//    /* Configure PLLSAI prescalers for LCD */
//    RCC_PLLSAIConfig(192, 7, 3);
//    RCC_LTDCCLKDivConfig(RCC_PLLSAIDivR_Div8);
//    
//    /* Enable PLLSAI Clock */
//    RCC_PLLSAICmd(ENABLE);
//    /* Wait for PLLSAI activation */
//    while(RCC_GetFlagStatus(RCC_FLAG_PLLSAIRDY) == RESET)
//    {
//    }
//    
//    xSize = LCD_GetXSizeEx(LayerIndex);
//    ySize = LCD_GetYSizeEx(LayerIndex);
//    
//    LTDC_InitStruct.LTDC_HorizontalSync = HSW;
//    /* Configure vertical synchronization height */
//    LTDC_InitStruct.LTDC_VerticalSync = VSW;
//    /* Configure accumulated horizontal back porch */
//    LTDC_InitStruct.LTDC_AccumulatedHBP = HBP; 
//    /* Configure accumulated vertical back porch */
//    LTDC_InitStruct.LTDC_AccumulatedVBP = VBP;  
//    /* Configure accumulated active width */  
//    LTDC_InitStruct.LTDC_AccumulatedActiveW = xSize + HBP;
//    /* Configure accumulated active height */
//    LTDC_InitStruct.LTDC_AccumulatedActiveH = ySize + VBP;
//    /* Configure total width */
//    LTDC_InitStruct.LTDC_TotalWidth = xSize + HBP + HFP; 
//    /* Configure total height */
//    LTDC_InitStruct.LTDC_TotalHeigh = ySize + VBP + VFP;
//    
//    LTDC_Init(&LTDC_InitStruct); //初始化LCD相关配置参数
//    
//    LTDC_ITConfig(LTDC_IT_LI, ENABLE); //使能行结束中断
//    NVIC_SetPriority(LTDC_IRQn, 0);
//    NVIC_EnableIRQ(LTDC_IRQn); 
//    
//  }   
//  
//  xSize = LCD_GetXSizeEx(LayerIndex);
//  ySize = LCD_GetYSizeEx(LayerIndex);
//  
//  BytesPerLine = GetBytesPerLine(LayerIndex, xSize);
//  
//  LTDC_Layer_Init.LTDC_HorizontalStart = HBP + 1;
//  LTDC_Layer_Init.LTDC_HorizontalStop = (xSize + HBP);
//  LTDC_Layer_Init.LTDC_VerticalStart = VBP + 1;
//  LTDC_Layer_Init.LTDC_VerticalStop = (ySize + VBP);
//  LTDC_Layer_Init.LTDC_PixelFormat = GetPixelformat(LayerIndex);
//  LTDC_Layer_Init.LTDC_ConstantAlpha = 255; 
//  LTDC_Layer_Init.LTDC_DefaultColorBlue = 0;        
//  LTDC_Layer_Init.LTDC_DefaultColorGreen = 0;       
//  LTDC_Layer_Init.LTDC_DefaultColorRed = 0;         
//  LTDC_Layer_Init.LTDC_DefaultColorAlpha = 0;
//#if (GUI_NUM_LAYERS > 1)
//  LTDC_Layer_Init.LTDC_BlendingFactor_1 = LTDC_BlendingFactor1_PAxCA;
//  LTDC_Layer_Init.LTDC_BlendingFactor_2 = LTDC_BlendingFactor2_PAxCA;
//#else  
//  LTDC_Layer_Init.LTDC_BlendingFactor_1 = LTDC_BlendingFactor1_CA;
//  LTDC_Layer_Init.LTDC_BlendingFactor_2 = LTDC_BlendingFactor2_CA;
//#endif
//  LTDC_Layer_Init.LTDC_CFBLineLength = BytesPerLine + 3;
//  LTDC_Layer_Init.LTDC_CFBPitch = BytesPerLine;
//  LTDC_Layer_Init.LTDC_CFBLineNumber = ySize; 
//  LTDC_Layer_Init.LTDC_CFBStartAdress = layer_address[LayerIndex];
//  
//  LTDC_LayerInit((LayerIndex == 0 ? LTDC_Layer1 : LTDC_Layer2), &LTDC_Layer_Init);
//  
//  /*  Enable LUT on demand */
//  BitsPerPixel = LCD_GetBitsPerPixelEx(LayerIndex);
//  if (BitsPerPixel <= 8) 
//  {
//    /* Enable usage of LUT for all modes with <= 8bpp */
//    LTDC_CLUTCmd((LayerIndex == 0 ? LTDC_Layer1 : LTDC_Layer2), ENABLE);
//  } 
//  else 
//  {
//    /*  Optional CLUT initialization for AL88 mode (16bpp) */
//    if (apColorConvAPI[LayerIndex] == GUICC_88666I) 
//    {
//      LTDC_CLUTCmd((LayerIndex == 0 ? LTDC_Layer1 : LTDC_Layer2), ENABLE);
//      for (i = 0; i < 256; i++) 
//      {
//        Color = LCD_API_ColorConv_8666.pfIndex2Color(i);
//        LTDC_CLUT_InitStruct.LTDC_BlueValue   =  ((Color >> 16) & 0xff);
//        LTDC_CLUT_InitStruct.LTDC_GreenValue  =  ((Color >>  8) & 0xff);
//        LTDC_CLUT_InitStruct.LTDC_RedValue    =   (Color        & 0xff);
//        LTDC_CLUT_InitStruct.LTDC_CLUTAdress  =  i << 24; 
//        LTDC_CLUTInit((LayerIndex == 0 ? LTDC_Layer1 : LTDC_Layer2), &LTDC_CLUT_InitStruct);
//      }
//    }
//  }
//  
//  /*  Enable layer */
//  LTDC_LayerCmd((LayerIndex == 0 ? LTDC_Layer1 : LTDC_Layer2), ENABLE);
//  
//  /* Reload configuration */
//  LTDC_ReloadConfig(LTDC_VBReload);
//}
/**
  * @brief  LCD Low level initialization 
  * @param  LayerIndex: Layer index
  * @retval None
  */
	
// void LCD_LL_Init(uint32_t LayerIndex) 
//{
//  uint32_t xSize, ySize, BytesPerLine, BitsPerPixel, i;
//  uint32_t Color;
//  static uint32_t Is_Initialized;
//  
//  LTDC_InitTypeDef       LTDC_InitStruct;
//  LTDC_Layer_InitTypeDef LTDC_Layer_Init;
//  LTDC_CLUT_InitTypeDef  LTDC_CLUT_InitStruct;
//  GPIO_InitTypeDef               GPIO_InitStructure;
//  
//  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
//  
//  /* Configure NCS in Output Push-Pull mode */
//  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
//  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
//  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
//  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
//  GPIO_Init(GPIOD, &GPIO_InitStructure);
//	 /* Configure the LCD Control pins ------------------------------------------*/
//  LCD_CtrlLinesConfig();
//  LCD_ChipSelect(DISABLE);
//  LCD_ChipSelect(ENABLE);

//  /* Configure the LCD_SPI interface -----------------------------------------*/
//  LCD_SPIConfig(); 
// 
//  /* Power on the LCD --------------------------------------------------------*/
//  LCD_PowerOn();
//    
//  if (LayerIndex >= GUI_NUM_LAYERS) 
//  {
//    return;
//  }
//  if (Is_Initialized == 0) 
//  {
//    Is_Initialized = 1;
//    
//    /*  Clock configuration */
//    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2D, ENABLE); //使能DMA2D时钟
//    
//    /* Enable the LTDC Clock */
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_LTDC, ENABLE);//使能LCD时钟
//    
//    /* Enable the DMA2D Clock */
//    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2D, ENABLE); 
//    
//    /* Configure the LCD Control pins */
//    LCD_AF_GPIOConfig();  //LCD引脚初始化
//    
//    /* Polarity configuration */
//    /* Initialize the horizontal synchronization polarity as active low */
//    LTDC_InitStruct.LTDC_HSPolarity = LTDC_HSPolarity_AL;     
//    /* Initialize the vertical synchronization polarity as active low */  
//    LTDC_InitStruct.LTDC_VSPolarity = LTDC_VSPolarity_AL;     
//    /* Initialize the data enable polarity as active low */
//    LTDC_InitStruct.LTDC_DEPolarity = LTDC_DEPolarity_AL;     
//    /* Initialize the pixel clock polarity as input pixel clock */ 
//    LTDC_InitStruct.LTDC_PCPolarity = LTDC_PCPolarity_IPC;
//    
//    /* Configure R,G,B component values for LCD background color */                   
//    LTDC_InitStruct.LTDC_BackgroundRedValue = 0;            
//    LTDC_InitStruct.LTDC_BackgroundGreenValue = 0;          
//    LTDC_InitStruct.LTDC_BackgroundBlueValue = 0;  
//    
//    
//    /* Configure PLLSAI prescalers for LCD */
//    RCC_PLLSAIConfig(192, 7, 3);
//    RCC_LTDCCLKDivConfig(RCC_PLLSAIDivR_Div8);
//    
//    /* Enable PLLSAI Clock */
//    RCC_PLLSAICmd(ENABLE);
//    /* Wait for PLLSAI activation */
//    while(RCC_GetFlagStatus(RCC_FLAG_PLLSAIRDY) == RESET)
//    {
//    }
//    
////    xSize = LCD_GetXSizeEx(LayerIndex);
////    ySize = LCD_GetYSizeEx(LayerIndex);
//    
//     /* Timing configuration */
//    /* Configure horizontal synchronization width */     
//  LTDC_InitStruct.LTDC_HorizontalSync = 9;
//  /* Configure vertical synchronization height */
//  LTDC_InitStruct.LTDC_VerticalSync = 1;
//  /* Configure accumulated horizontal back porch */
//  LTDC_InitStruct.LTDC_AccumulatedHBP = 29; 
//  /* Configure accumulated vertical back porch */
//  LTDC_InitStruct.LTDC_AccumulatedVBP = 3;  
//  /* Configure accumulated active width */  
//  LTDC_InitStruct.LTDC_AccumulatedActiveW = 269;
//  /* Configure accumulated active height */
//  LTDC_InitStruct.LTDC_AccumulatedActiveH = 323;
//  /* Configure total width */
//  LTDC_InitStruct.LTDC_TotalWidth = 279; 
//  /* Configure total height */
//  LTDC_InitStruct.LTDC_TotalHeigh = 327;
//    
//    LTDC_Init(&LTDC_InitStruct); //初始化LCD相关配置参数
//    
//    LTDC_ITConfig(LTDC_IT_LI, ENABLE); //使能行结束中断
//    NVIC_SetPriority(LTDC_IRQn, 0);
//    NVIC_EnableIRQ(LTDC_IRQn); 
//    
//  }   
  
//  xSize = LCD_GetXSizeEx(LayerIndex);
//  ySize = LCD_GetYSizeEx(LayerIndex);
  
 // BytesPerLine = GetBytesPerLine(LayerIndex, xSize);
//  
//  LTDC_Layer_Init.LTDC_HorizontalStart = 30;
//  LTDC_Layer_Init.LTDC_HorizontalStop = (240 + 30 - 1); 
//  LTDC_Layer_Init.LTDC_VerticalStart = 4;
//  LTDC_Layer_Init.LTDC_VerticalStop = 150 + 4 -1; 
//  
//  LTDC_Layer_Init.LTDC_PixelFormat =LTDC_Pixelformat_RGB565;
//  LTDC_Layer_Init.LTDC_ConstantAlpha = 255; 
//  LTDC_Layer_Init.LTDC_DefaultColorBlue = 0;        
//  LTDC_Layer_Init.LTDC_DefaultColorGreen = 0;       
//  LTDC_Layer_Init.LTDC_DefaultColorRed = 0;         
//  LTDC_Layer_Init.LTDC_DefaultColorAlpha = 0;
//#if (GUI_NUM_LAYERS > 1)
//  LTDC_Layer_Init.LTDC_BlendingFactor_1 = LTDC_BlendingFactor1_PAxCA;
//  LTDC_Layer_Init.LTDC_BlendingFactor_2 = LTDC_BlendingFactor2_PAxCA;
//#else  
//  LTDC_Layer_Init.LTDC_BlendingFactor_1 = LTDC_BlendingFactor1_CA;
//  LTDC_Layer_Init.LTDC_BlendingFactor_2 = LTDC_BlendingFactor2_CA;
//#endif
//  LTDC_Layer_Init.LTDC_CFBLineLength = 240*2 + 3;
//  LTDC_Layer_Init.LTDC_CFBPitch = 240*2;
//  LTDC_Layer_Init.LTDC_CFBLineNumber = 320; 
//  LTDC_Layer_Init.LTDC_CFBStartAdress = layer_address[LayerIndex];
//  
//  LTDC_LayerInit((LayerIndex == 0 ? LTDC_Layer1 : LTDC_Layer2), &LTDC_Layer_Init);
//  
//  /*  Enable LUT on demand */
//  BitsPerPixel = LCD_GetBitsPerPixelEx(LayerIndex);
//  if (BitsPerPixel <= 8) 
//  {
//    /* Enable usage of LUT for all modes with <= 8bpp */
//    LTDC_CLUTCmd((LayerIndex == 0 ? LTDC_Layer1 : LTDC_Layer2), ENABLE);
//  } 
//  else 
//  {
//    /*  Optional CLUT initialization for AL88 mode (16bpp) */
//    if (apColorConvAPI[LayerIndex] == GUICC_88666I) 
//    {
//      LTDC_CLUTCmd((LayerIndex == 0 ? LTDC_Layer1 : LTDC_Layer2), ENABLE);
//      for (i = 0; i < 256; i++) 
//      {
//        Color = LCD_API_ColorConv_8666.pfIndex2Color(i);
//        LTDC_CLUT_InitStruct.LTDC_BlueValue   =  ((Color >> 16) & 0xff);
//        LTDC_CLUT_InitStruct.LTDC_GreenValue  =  ((Color >>  8) & 0xff);
//        LTDC_CLUT_InitStruct.LTDC_RedValue    =   (Color        & 0xff);
//        LTDC_CLUT_InitStruct.LTDC_CLUTAdress  =  i << 24; 
//        LTDC_CLUTInit((LayerIndex == 0 ? LTDC_Layer1 : LTDC_Layer2), &LTDC_CLUT_InitStruct);
//      }
//    }
//  }
//  
//  /*  Enable layer */
//  LTDC_LayerCmd((LayerIndex == 0 ? LTDC_Layer1 : LTDC_Layer2), ENABLE);
//  
//  /* Reload configuration */
//  LTDC_ReloadConfig(LTDC_VBReload);
//	 /* dithering activation */
//  LTDC_DitherCmd(ENABLE);
//}
/**
  * @brief  Returns the buffer size of the selected layer
  * @param  LayerIndex: Layer index
  * @retval Buffer size
  */
static uint32_t GetBufferSize(uint32_t LayerIndex) 
{
  uint32_t BufferSize;

  BufferSize = layer_xsize[LayerIndex] * layer_ysize[LayerIndex] * layer_bpp[LayerIndex];
  return BufferSize;
}

/**
  * @brief  
  * @param  pSrc
  * @param  pDst
  * @param  OffSrc
  * @param  OffDst
  * @param  PixelFormatDst
  * @param  xSize
  * @param  ySize
  * @retval None
  */
static void DMA_DrawBitmapL8(void * pSrc, void * pDst,  uint32_t OffSrc, uint32_t OffDst, uint32_t PixelFormatDst, uint32_t xSize, uint32_t ySize)
{
  /* Set up mode */
  DMA2D->CR      = 0x00010000UL | (1 << 9);         /* Control Register (Memory to memory with pixel format conversion and TCIE) */
  
  /* Set up pointers */
  DMA2D->FGMAR   = (uint32_t)pSrc;                  /* Foreground Memory Address Register (Source address) */
  DMA2D->OMAR    = (uint32_t)pDst;                  /* Output Memory Address Register (Destination address) */
  
